from job_place import JobPlace

#===================================================================================================

niisi =      JobPlace('Федеральное государственное учреждение "Федеральный научный центр Научно-исследовательский институт системных исследований Российской академии наук"', 'ФГУ ФНЦ НИИСИ РАН')
niisi_jscc = JobPlace('Межведомственный суперкомпьютерный центр Российской академии наук', 'МСЦ РАН', niisi)
kfu =        JobPlace('Казанский (Приволжский) федеральный университет', 'КФУ')
kfu_imm =    JobPlace('Институт математики и механики имени Н. И. Лобачевского', '', kfu)
kgeu =       JobPlace('Казанский государственный энергетический университет', 'КГЭУ')

#===================================================================================================

if __name__ == '__main__':
    pass

#===================================================================================================
