from job_place import JobPlace

#===================================================================================================

kfu =     JobPlace('Казанский (Приволжский) федеральный университет',         'КФУ')
kfu_imm = JobPlace('Институт математики и механики имени Н. И. Лобачевского', '', kfu)
kgeu =    JobPlace('Казанский государственный энергетический университет',    'КГЭУ')

#===================================================================================================

if __name__ == '__main__':
    pass

#===================================================================================================
