from job_place import JobPlace

#===================================================================================================

ao_npo_goi =     JobPlace('АО «Научно-производственное объединение Государственный оптический институт им. С. И. Вавилова»', 'АО НПО ГОИ')
ciam =           JobPlace('ФАУ Центральный институт авиационного моторостроения имени П. И. Баранова', 'ЦИАМ')
cpbgut =         JobPlace('Санкт-Петербургский государственный университет телекоммуникаций имени профессора М. А. Бонч-Бруевича', 'СПбГУТ')
innopolis =      JobPlace('Университет Иннополис', 'Иннополис')
ire =            JobPlace('Институт радиотехники и электроники им. В. А. Котельникова РАН', 'ИРЭ РАН')
kfu =            JobPlace('Казанский (Приволжский) федеральный университет', 'КФУ')
kfu_imm =        JobPlace('Институт математики и механики имени Н. И. Лобачевского', '', kfu)
kgau =           JobPlace('Казанский государственный аграрный университет', 'КГАУ')
kgeu =           JobPlace('Казанский государственный энергетический университет', 'КГЭУ')
knitu =          JobPlace('ФГБОУ «Казанский национальный исследовательский технологический университет»', 'КНИТУ', '')
miet =           JobPlace('Национальный исследовательский университет "МИЭТ"', 'МИЭТ')
mirea =          JobPlace('МИРЭА', 'МИРЭА')
mtusi =          JobPlace('Московский технический университет связи и информатики', 'МТУСИ')
niisi =          JobPlace('Федеральное государственное учреждение "Федеральный научный центр Научно-исследовательский институт системных исследований Российской академии наук"', 'ФГУ ФНЦ НИИСИ РАН')
niisi_jscc =     JobPlace('Межведомственный суперкомпьютерный центр Российской академии наук', 'МСЦ РАН', niisi)
pguti =          JobPlace('Поволжский государственный университет телекоммуникаций и информатики', 'ПГУТИ')
rgu_kos =        JobPlace('РГУ им. А.Н.Косыгина', 'РГУ')
tsniigeolnerud = JobPlace('Центральный научно-исследовательский институт геологии нерудных полезных ископаемых', 'ЦНИИГЕОЛНЕРУД')

#===================================================================================================

if __name__ == '__main__':
    pass

#===================================================================================================
