from job_place import JobPlace

#===================================================================================================

niisi =      JobPlace('Федеральное государственное учреждение "Федеральный научный центр Научно-исследовательский институт системных исследований Российской академии наук"', 'ФГУ ФНЦ НИИСИ РАН')
niisi_jscc = JobPlace('Межведомственный суперкомпьютерный центр Российской академии наук', 'МСЦ РАН', niisi)
kfu =        JobPlace('Казанский (Приволжский) федеральный университет', 'КФУ')
kfu_imm =    JobPlace('Институт математики и механики имени Н. И. Лобачевского', '', kfu)
kgeu =       JobPlace('Казанский государственный энергетический университет', 'КГЭУ')
mtusi =      JobPlace('Московский технический университет связи и информатики', 'МТУСИ')
ao_npo_goi = JobPlace('АО «Научно-производственное объединение Государственный оптический институт им. С. И. Вавилова»', 'АО НПО ГОИ')
cpbgut =     JobPlace('Санкт-Петербургский государственный университет телекоммуникаций имени профессора М. А. Бонч-Бруевича', 'СПбГУТ')
pguti =      JobPlace('Поволжский государственный университет телекоммуникаций и информатики', 'ПГУТИ')

#===================================================================================================

if __name__ == '__main__':
    pass

#===================================================================================================
