from journal import Journal

#===================================================================================================

mathematical_modeling = Journal('Математическое Моделирование')
lncc =                  Journal('Lecture Notes in Computer Science')

all = \
[
    mathematical_modeling
]

#===================================================================================================

if __name__ == '__main__':
    pass

#===================================================================================================
