
#===================================================================================================

class Nod:
    """
    Node of tree.
    """

    #-----------------------------------------------------------------------------------------------

    def __init__(self, label, name):
        """
        Constructor.

        Parameters
        ----------
        label : str
            Label.
        name : str
            Name.
        """

        self.label = label
        self.name = name
        self.money = 0.0
        self.ch = []

    #-----------------------------------------------------------------------------------------------

    @property
    def xmoney(self):
        """
        Get extended money.

        Returns
        -------
        float
            Extended money.
        """

        if self.ch == []:
            return self.money
        else:
            return sum(c.xmoney for c in self.ch)

    #-----------------------------------------------------------------------------------------------

    def __repr__(self):
        """
        String representation.

        Returns
        -------
        str
            String representation.
        """

        return f'{self.label} {self.name} : {self.xmoney}'

    #-----------------------------------------------------------------------------------------------

    def __getitem__(self, s):
        """
        Get item.

        Parameters
        ----------
        s : str
            Index.

        Returns
        -------
        Nod
            Child.
        """

        if s == 'II':
            return self.ch[0]
        elif s == 'III':
            return self.ch[1]
        else:
            return self.ch[s - 1]

    #-----------------------------------------------------------------------------------------------

    def count(self):
        """
        Count.

        Returns
        -------
        int
            Count of elements (including self).
        """

        return 1 + sum([c.count() for c in self.ch])

    #-----------------------------------------------------------------------------------------------

    def add(self, n):
        """
        Add new child.

        Parameters
        ----------
        n : Nod
            Node.

        Returns
        -------
        Nod
            New node.
        """

        self.ch.append(n)

        return n

    #-----------------------------------------------------------------------------------------------

    def print(self, off=0):
        """
        Print tree.

        Parameters
        ----------
        off : int
            Offset.
        """

        pre = ' ' * (2 * off)

        print(f'{pre}{self}')

        for c in self.ch:
            c.print(off + 1)

    #-----------------------------------------------------------------------------------------------

    def flatten(self):
        """
        Get all nodes in flatten view.

        Returns
        -------
        [Nod]
            List of nodes.
        """

        if self.ch == []:
            return [self]

        f = [self]

        for c in self.ch:
            f = f + c.flatten()

        return f

#===================================================================================================

def create_outlay_skeleton(obj):
    """
    Create outlay.

    Parameters
    ----------
    obj : str
        Object for outlay.

    Returns
    -------
    Nod
        Outlay root node.
    """

    lI = Nod('I.', f'ВСЕГО по {obj}, в том числе:')
    lII = lI.add(Nod('II.', 'Прямые и общепроизводственные затраты'))
    lII1 = lII.add(Nod('1.', 'Затраты на оплату труда работников и начисления на выплаты по оплате труда работников, в том числе:'))
    lII11 = lII1.add(Nod('1.1.', 'Затраты на оплату труда работников, непосредственно связанных с выполнением работы, и начисления на выплаты по оплате труда работников, непосредственно связанных с выполнением работы, которые определяются исходя из показателей необходимых трудовых ресурсов (трудозатрат), рассчитываемых с учетом длительности выполнения научной темы по направлению научного исследования, состава, квалификации и численности работников, участвующих в выполнении научной темы, исчисляемых в человеко-месяцах'))
    lII12 = lII1.add(Nod('1.2', 'Затраты на оплату труда работников, которые не принимают непосредственного участия в выполнении работы, и начисления на выплаты по оплате труда работников, которые не принимают непосредственного участия в выполнении работы, включая административно-управленческий персонал'))
    lII2 = lII.add(Nod('2.', 'Затраты на приобретение материальных запасов и на приобретение движимого имущества (основных средств и нематериальных активов), используемого в процессе выполнения работы, с учетом срока его полезного использования, а также затраты на аренду указанного имущества, в том числе:'))
    lII21 = lII2.add(Nod('2.1.', 'Затраты на приобретение материальных запасов'))
    lII22 = lII2.add(Nod('2.2.', 'Затраты на приобретение движимого имущества (основных средств и нематериальных активов)'))
    lII23 = lII2.add(Nod('2.3.', 'Затраты на аренду движимого имущества (основных средств и нематериальных активов)'))
    lII3 = lII.add(Nod('3.', 'Затраты на иные расходы, непосредственно связанные с выполнением работы, в том числе:'))
    lII31 = lII3.add(Nod('3.1.', 'Командировочные расходы'))
    lII32 = lII3.add(Nod('3.2.', 'Затраты на закупку работ, выполняемых сторонними организациями'))
    lII33 = lII3.add(Nod('3.3.', 'Затраты на закупку услуг, выполняемых сторонними организациями'))
    lII34 = lII3.add(Nod('3.4.', 'Затраты на повышение квалификации и обучение'))
    lII35 = lII3.add(Nod('3.5.', 'Затраты на участие в выставках, конференциях и иных мероприятиях'))
    lII36 = lII3.add(Nod('3.6.', 'Иные расходы, не указанные в пунктах 3.1.-3.5. (указать)'))
    lII4 = lII.add(Nod('4.', 'Общепроизводственные затраты на содержание и аренду объектов недвижимого имущества, необходимого для выполнения государственного задания'))
    lII41 = lII4.add(Nod('4.1.', 'Затраты на содержание объектов недвижимого имущества'))
    lII42 = lII4.add(Nod('4.2.', 'Затраты на аренду объектов недвижимого имущества'))
    lII5 = lII.add(Nod('5.', 'Общепроизводственные затраты на содержание объектов особо ценного движимого имущества и имущества, необходимого для выполнения государственного задания, а также затраты на аренду указанного имущества'))
    lII51 = lII5.add(Nod('5.1.', 'Затраты на содержание объектов особо ценного движимого имущества и имущества, необходимого для выполнения государственного задания,'))
    lII52 = lII5.add(Nod('5.2.', 'Затраты на аренду объектов особо ценного движимого имущества и имущества, необходимого для выполнения государственного задания,'))
    lII6 = lII.add(Nod('6.', 'Общепроизводственные затраты на приобретение услуг связи'))
    lII7 = lII.add(Nod('7.', 'Общепроизводственные затраты на приобретение транспортных услуг'))
    lII8 = lII.add(Nod('8.', 'Затраты на прочие общепроизводственные нужды'))
    lIII = lI.add(Nod('III.', 'Общехозяйственные затраты'))
    lIII1 = lIII.add(Nod('1.', 'Затраты на оплату труда работников и начисления на выплаты по оплате труда работников, в том числе:'))
    lIII11 = lIII1.add(Nod('1.1.', 'Затраты на оплату труда работников, которые не принимают непосредственного участия в выполнении работы, и начисления на выплаты по оплате труда работников, которые не принимают непосредственного участия в выполнении работы, включая административно-управленческий персонал'))
    lIII2 = lIII.add(Nod('2.', 'Общехозяйственные затраты на содержание и аренду объектов недвижимого имущества, необходимого для выполнения государственного задания'))
    lIII21 = lIII2.add(Nod('2.1.', 'Затраты на содержание объектов недвижимого имущества'))
    lIII22 = lIII2.add(Nod('2.2.', 'Затраты на аренду объектов недвижимого имущества'))
    lIII3 = lIII.add(Nod('3.', 'Общехозяйственные затраты на содержание объектов особо ценного движимого имущества и имущества, необходимого для выполнения государственного задания, а также затраты на аренду указанного имущества'))
    lIII31 = lIII3.add(Nod('3.1.', 'Затраты на содержание объектов особо ценного движимого имущества и имущества, необходимого для выполнения государственного задания,'))
    lIII32 = lIII3.add(Nod('3.2.', 'Затраты на аренду объектов особо ценного движимого имущества и имущества, необходимого для выполнения государственного задания,'))
    lIII4 = lIII.add(Nod('4.', 'Общехозяйственные затраты на приобретение услуг связи'))
    lIII5 = lIII.add(Nod('5.', 'Общехозяйственные затраты на приобретение транспортных услуг'))
    lIII6 = lIII.add(Nod('6.', 'Затраты на оплату коммунальных услуг'))
    lIII7 = lIII.add(Nod('7.', 'Затраты на прочие общехозяйственные нужды'))

    return lI

#---------------------------------------------------------------------------------------------------

def create_outlay(obj, lII11, lII12, lII21, lII22, lII23,
                  lII31, lII32, lII33, lII34, lII35, lII36,
                  lII41, lII42, lII51, lII52, lII6, lII7, lII8,
                  lIII11, lIII21, lIII22, lIII31, lIII32, lIII4, lIII5, lIII6, lIII7):
    """
    Create outlay.

    Parameters
    ----------
    obj : str
        Object for outlay.
    lII11 : float
        Value II.1.1.
    lII12 : float
        Value II.1.2.
    lII21 : float
        Value II.2.1.
    lII22 : float
        Value II.2.2.
    lII23 : float
        Value II.2.3.
    lII31 : float
        Value II.3.1.
    lII32 : float
        Value II.3.2.
    lII33 : float
        Value II.3.3.
    lII34 : float
        Value II.3.4.
    lII35 : float
        Value II.3.5.
    lII36 : float
        Value II.3.6.
    lII41 : float
        Value II.4.1.
    lII42 : float
        Value II.4.2.
    lII51 : float
        Value II.5.1.
    lII52 : float
        Value II.5.2.
    lII6 : float
        Velue II.6.
    lII7 : float
        Value II.7.
    lII8 : float
        Value II.8.
    lIII11 : float
        Value III.1.1.
    lIII21 : float
        Value III.2.1.
    lIII22 : float
        Value III.2.2.
    lIII31 : float
        Value III.3.1.
    lIII32 : float
        Value III.3.2.
    lIII4 : float
        Value III.4.
    lIII5 : float
        Value III.5.
    lIII6 : float
        Value III.6.
    lIII7 : float
        Value III.7.

    Returns
    -------
    Nod
        Outlay node.
    """

    t = create_outlay_skeleton(obj)

    t['II'][1][1].money = lII11
    t['II'][1][2].money = lII12
    t['II'][2][1].money = lII21
    t['II'][2][2].money = lII22
    t['II'][2][3].money = lII23
    t['II'][3][1].money = lII31
    t['II'][3][2].money = lII32
    t['II'][3][3].money = lII33
    t['II'][3][4].money = lII34
    t['II'][3][5].money = lII35
    t['II'][3][6].money = lII36
    t['II'][4][1].money = lII41
    t['II'][4][2].money = lII42
    t['II'][5][1].money = lII51
    t['II'][5][2].money = lII52
    t['II'][6].money = lII6
    t['II'][7].money = lII7
    t['II'][8].money = lII8
    t['III'][1][1].money = lIII11
    t['III'][2][1].money = lIII21
    t['III'][2][2].money = lIII22
    t['III'][3][1].money = lIII31
    t['III'][3][2].money = lIII32
    t['III'][4].money = lIII4
    t['III'][5].money = lIII5
    t['III'][6].money = lIII6
    t['III'][7].money = lIII7

    return t

#---------------------------------------------------------------------------------------------------

def duplicate_outlay(t, obj, part):
    """
    Duplicate outlay.

    Parameters
    ----------
    t : Nod
        Outlay.
    obj : str
        New object for outlay.
    part : float
        Part for extract.

    Returns
    -------
    Nod
        New outlay.
    """

    return create_outlay(obj,
                         t['II'][1][1].money * part,
                         t['II'][1][2].money * part,
                         t['II'][2][1].money * part,
                         t['II'][2][2].money * part,
                         t['II'][2][3].money * part,
                         t['II'][3][1].money * part,
                         t['II'][3][2].money * part,
                         t['II'][3][3].money * part,
                         t['II'][3][4].money * part,
                         t['II'][3][5].money * part,
                         t['II'][3][6].money * part,
                         t['II'][4][1].money * part,
                         t['II'][4][2].money * part,
                         t['II'][5][1].money * part,
                         t['II'][5][2].money * part,
                         t['II'][6].money * part,
                         t['II'][7].money * part,
                         t['II'][8].money * part,
                         t['III'][1][1].money * part,
                         t['III'][2][1].money * part,
                         t['III'][2][2].money * part,
                         t['III'][3][1].money * part,
                         t['III'][3][2].money * part,
                         t['III'][4].money * part,
                         t['III'][5].money * part,
                         t['III'][6].money * part,
                         t['III'][7].money * part)

#===================================================================================================

if __name__ == '__main__':
    pass

#===================================================================================================
