from person import Person

#===================================================================================================

potashev_ka =    Person('К', 'А', 'Поташев')
mazo_ab =        Person('А', 'Б', 'Мазо')
kazantsev_sy =   Person('Сергей', 'Юрьевич', 'Казанцев')
sapozhnikov_mv = Person('Максим', 'Вячеславович', 'Сапожников')
terekhin_dn =    Person('Дмитрий', 'Николаевич', 'Терехин')
burdin_av =      Person('Антон', 'Владимирович', 'Бурдин')

#===================================================================================================

if __name__ == '__main__':
    pass

#===================================================================================================
